import requests
from bs4 import BeautifulSoup

headers = {'User-Agent' : 'Mozilla/5.0 (Windows NT 10.0; Win64; x64)AppleWebKit/537.36 (KHTML, like Gecko) Chrome/73.0.3683.86 Safari/537.36'}
data = requests.get('https://ko.wiktionary.org/wiki/%EB%B6%84%EB%A5%98:%ED%95%9C%EA%B5%AD%EC%96%B4_%EC%8B%9D%EB%AC%BC',headers=headers)

soup = BeautifulSoup(data.text, 'html.parser')
randomname_list=['가냘픈', '가는', '가엾은', '가파른', '같은', '거센', '거친', '건조한', '검은', '게으른', '게을러빠진', '게을러터진', '고달픈', '고른', '고마운', '고운', '고픈', '곧은', '괜찮은', '구석진', '굳은', '굵은', '귀여운', '그런', '그른', '그리운', '기다란', '기쁜', '긴', '깊은', '깎아지른', '깨끗한', '나쁜', '나은', '난데없는', '날랜', '날카로운', '낮은', '너그러운', '너른', '널따란', '넓은', '네모난', '노란', '높은', '누런', '눅은', '느닷없는', '느린', '늦은', '다른', '더러운', '더운', '덜된', '돈', '동그란', '돼먹잖은', '된', '둥그런', '둥근', '뒤늦은', '드문', '딱한', '때늦은', '뛰어난', '뜨거운', '막다른', '막중한', '많은', '매운', '먼', '멋진', '메마른', '메스꺼운', '모난', '못난', '못된', '못생긴', '무거운', '무딘', '무른', '무서운', '미끈미끈한', '미운', '미친', '바람직스러운', '반가운', '밝은', '밤늦은', '보드라운', '보람찬', '보잘것없는', '부드러운', '부른', '붉은', '비싼', '빠른', '빨간', '뻘건', '뼈저린', '뽀얀', '뿌연', '새로운', '서툰', '섣부른', '설운', '성가신', '센', '수다스러운', '수줍은', '쉬운', '스스러운', '슬픈', '시원찮은', '싫은', '싼', '쌀쌀맞은', '쏜살같은', '쓰디쓴', '쓰린', '쓴', '아니꼬운', '아닌', '아름다운', '아쉬운', '아픈', '안된', '안쓰러운', '안타까운', '않은', '알맞은', '약빠른', '약은', '얇은', '얕은', '어두운', '어려운', '어린', '언짢은', '엄청난', '없는', '여문', '열띤', '예쁜', '올바른', '옳은', '외로운', '우스운', '의심쩍은', '이른', '익은', '있는', '작은', '잘난', '잘빠진', '잘생긴', '재미있는', '적은', '젊은', '점잖은', '조그만', '좁은', '좋은', '주제넘은', '줄기찬', '즐거운', '지나친', '지혜로운', '질긴', '짓궂은', '짙은', '짠', '짧은', '케케묵은', '큰', '탐스러운', '턱없는', '푸른', '하나같은', '한결같은', '흐린', '희망찬', '흰', '힘겨운', '힘찬']
randomname_list_2=['가경자', '가는보라색우무', '가는쑥부쟁이', '가는잎벚나무', '가두배추', '가라', '가락풀', '가랑잎', '가막살나무', '가문비', '가새잎머루', '가시나무', '가시비름', '가을배추', '가죽나무', '가지', '각시붓꽃', '갈', '갈대', '감당', '감람', '감자', '감저', '갓', '강원고사리', '개과', '개나리', '개나리꽃', '개망초', '개살구', '개암', '개양귀비', '검정알나무', '겨우살이', '겨울나이', '겨자', '견과', '견우화', '겹씨방', '계피', '고구마', '고마리', '고사리', '고수', '고추', '곡물', '골풀', '관목', '교목', '구근식물', '구절초', '국화', '군계', '군자란', '귀리', '귀화식물', '규화', '귤', '그레이프프루트', '극지식물', '극핵', '근대', '근상엽', '근생엽', '금낭화', '금어초', '금잔화', '기생식물', '길상초', '길짱구', '김', '깨', '꽃', '꽃가루', '꽃잎', '꽃차례', '나도사푸란', '나라꽃', '나리', '나리꽃', '나리난초', '나모', '나무', '나무뿌리', '나비국수나무', '나비나물', '나팔꽃', '낙엽송', '낙타초', '낚시제비꽃', '난', '난초', '남산제비꽃', '남새', '남천', '남천촉', '남초', '노가지나무', '녹두', '녹색식물', '녹색조류', '녹조', '녹조류', '녹조식물', '눈', '느티나무', '다래', '다릅나무', '다복솔', '닥나무', '단성결실', '단풍잎돼지풀', '달', '달래', '달리아', '담배', '담쟁이덩굴', '당귀', '당근', '당년초', '당오동', '당창포', '당추자', '대', '대나무', '대마', '대추', '대파', '덩굴', '덩굴식물', '데이지', '도토리', '독버섯', '독초', '돌김', '동백꽃', '동아', '돼지풀', '두견화', '두리안', '두상화', '두송', '두숙류', '두싹잎식물', '두초류', '두충', '둥글파', '들국화', '들쭉나무', '등나무', '등피화', '딜', '따꽃', '딸기', '땅속줄기', '땅콩', '라벤더', '라이그라스', '라일락', '라플레시아', '레몬', '마', '마늘', '마슬', '마타리', '만병초', '말', '망고', '망초', '매화', '맥문동', '머루', '메밀', '멜론', '명사', '명자꽃', '모과', '모란', '모시', '목단', '목단화', '목련', '목면', '목지', '목질부', '목질섬유', '목향', '목화', '무', '무궁화', '무우', '무화과', '물망초', '미나리아재비', '미역', '민들레', '밀', '밀감', '바나나', '바닐라']
# print(soup)
# 코딩 시작

#mw-pages > div > div > div:nth-child(3) > ul > li:nth-child(34) > a
#mw-pages > div > div > div:nth-child(1) > h3
#mw-pages > div > div > div:nth-child(1) > ul > li:nth-child(1)
# a=soup.select('li > a')
# print(a)
q=soup.select('#mw-pages > div > div > div')
# print(q)

random_name_2=[]
for i in range(200):
    b=soup.select('li > a')[i]['title']
    random_name_2.append(b)
print(random_name_2)


